<a href="https://colab.research.google.com/github/MLgeek96/Interview-Preparation-Kit/blob/master/Udemy/Python%20%26%20ML%20for%20Financial%20Analysis/8_Python_101_Python_Libraries_for_Data_Analysis_Pandas_Skeleton.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1. PANDAS BASICS

In [1]:
# Pandas is a data manipulation and analysis tool that is built on Numpy.
# Pandas uses a data structure known as DataFrame (think of it as Microsoft excel in Python). 
# DataFrames empower programmers to store and manipulate data in a tabular fashion (rows and columns).
# Series Vs. DataFrame? Series is considered a single column of a DataFrame.

In [2]:
import pandas as pd

In [3]:
# Let's define two lists as shown below:
my_list = ['AAPL', 'AMZN', 'T']
my_list

['AAPL', 'AMZN', 'T']

In [4]:
label = ["stock#1", "stock#2", "stock#3"]
label

['stock#1', 'stock#2', 'stock#3']

In [5]:
type(label)

list

In [6]:
type(my_list)

list

In [7]:
# Let's create a one dimensional Pandas "series" 
# Note that series is formed of data and associated labels 
x_series = pd.Series(data = my_list, index=label)

In [8]:
# Let's view the series
x_series

stock#1    AAPL
stock#2    AMZN
stock#3       T
dtype: object

In [9]:
# Let's obtain the datatype
type(x_series)

pandas.core.series.Series

In [10]:
# Let's define a two-dimensional Pandas DataFrame
# Note that you can create a pandas dataframe from a python dictionary
bank_client_df = pd.DataFrame({'Bank client ID': [111, 222, 333, 444],
                               "Bank Client Name": ['Chanel', 'Steve', 'Mitch', 'Ryan'],
                               "Net worth [$]": [3500, 29000, 10000, 2000],
                               "Years with bank": [3, 4, 9, 5]})
bank_client_df

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [11]:
# Let's obtain the data type 
type(bank_client_df)

pandas.core.frame.DataFrame

In [12]:
# you can only view the first couple of rows using .head()
bank_client_df.head(2)

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4

In [13]:
# you can only view the last couple of rows using .tail()
bank_client_df.tail(2)

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
2             333            Mitch          10000                9
3             444             Ryan           2000                5

**MINI CHALLENGE #1:**
- **A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)**
- **Calculate the total value of the porfolio including all stocks**

In [14]:
portfolio_df = pd.DataFrame({"stock ticker symbol": ['AAPL', 'AMZN', 'T'],
                             "Number of stocks": [3, 4, 9],
                             "Price per share": [3500, 200, 40]})
portfolio_df

  stock ticker symbol  Number of stocks  Price per share
0                AAPL                 3             3500
1                AMZN                 4              200
2                   T                 9               40

In [15]:
stocks_dollar_value = portfolio_df["Number of stocks"] * portfolio_df["Price per share"]
print(stocks_dollar_value)
print("Total potfolio value = {}".format(stocks_dollar_value.sum()))

0    10500
1      800
2      360
dtype: int64
Total potfolio value = 11660

# 2. PANDAS WITH CSV AND HTML DATA

In [16]:
# In order to access data on Google Drive, you need to mount the drive to access it's content
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [17]:
# Pandas is used to read a csv file and store data in a DataFrame
bank_df = pd.read_csv("/content/drive/My Drive/Python & ML for Financial Analysis/Part 1. Python Programming Fundamentals/sample_csv_file.csv")

In [18]:
bank_df

    first    last              email   postal  gender      dollar
0  Joseph  Patton     daafeja@boh.jm  M6U 5U7    Male  $2,629.13
1    Noah   Moran  guutodi@bigwoc.kw  K2D 4M9    Male  $8,626.96
2    Nina  Keller    azikez@gahew.mr  S1T 4E6    Male  $9,072.02

In [19]:
# write to a csv file without an index
bank_df.to_csv("sample_output.csv", index=False)

In [20]:
# write to a csv file with an index
bank_df.to_csv("sample_output.csv")

In [21]:
# Read tabular data using read_html
house_prices_df = pd.read_html("https://www.livingin-canada.com/house-prices-canada.html")

In [22]:
house_prices_df

[                                                City  ...                                    12 Month Change
 0                                      Vancouver, BC  ...                                           + 2.63 %
 1                                       Toronto, Ont  ...                                            +10.2 %
 2                                        Ottawa, Ont  ...                                           + 15.4 %
 3                                       Calgary, Alb  ...                                            – 1.5 %
 4                                      Montreal, Que  ...                                            + 9.3 %
 5                                        Halifax, NS  ...                                            + 3.6 %
 6                                       Regina, Sask  ...                                            – 3.9 %
 7                                    Fredericton, NB  ...                                            – 4.3 %
 8  (adsbygoogle = window.adsbygoogle || []).push(...  ...  (adsbygoogle = window.adsbygoogle || []).push(...

 [9 rows x 3 columns],
                                              Province  ...                                    12 Month Change
 0                                    British Columbia  ...                                            + 7.6 %
 1                                             Ontario  ...                                            – 3.2 %
 2                                             Alberta  ...                                            – 7.5 %
 3                                              Quebec  ...                                            + 7.6 %
 4                                            Manitoba  ...                                            – 1.4 %
 5                                        Saskatchewan  ...                                            – 3.8 %
 6                                         Nova Scotia  ...                                            + 3.5 %
 7                                Prince Edward Island  ...                                            + 3.0 %
 8                             Newfoundland / Labrador  ...                                            – 1.6 %
 9                                       New Brunswick  ...                                            – 2.2 %
 10                                   Canadian Average  ...                                            – 1.3 %
 11  (adsbygoogle = window.adsbygoogle || []).push(...  ...  (adsbygoogle = window.adsbygoogle || []).push(...

 [12 rows x 3 columns]]

In [23]:
house_prices_df[1]

                                             Province  ...                                    12 Month Change
0                                    British Columbia  ...                                            + 7.6 %
1                                             Ontario  ...                                            – 3.2 %
2                                             Alberta  ...                                            – 7.5 %
3                                              Quebec  ...                                            + 7.6 %
4                                            Manitoba  ...                                            – 1.4 %
5                                        Saskatchewan  ...                                            – 3.8 %
6                                         Nova Scotia  ...                                            + 3.5 %
7                                Prince Edward Island  ...                                            + 3.0 %
8                             Newfoundland / Labrador  ...                                            – 1.6 %
9                                       New Brunswick  ...                                            – 2.2 %
10                                   Canadian Average  ...                                            – 1.3 %
11  (adsbygoogle = window.adsbygoogle || []).push(...  ...  (adsbygoogle = window.adsbygoogle || []).push(...

[12 rows x 3 columns]

**MINI CHALLENGE #2:**
- **Write a code that uses Pandas to read tabular US retirement data**
- **You can use data from here: https://www.ssa.gov/oact/progdata/nra.html**

In [24]:
retirement_age_df = pd.read_html("https://www.ssa.gov/oact/progdata/nra.html")
retirement_age_df

[                                        Year of birth                                                Age
 0                                      1937 and prior                                                 65
 1                                                1938                                    65 and 2 months
 2                                                1939                                    65 and 4 months
 3                                                1940                                    65 and 6 months
 4                                                1941                                    65 and 8 months
 5                                                1942                                   65 and 10 months
 6                                             1943-54                                                 66
 7                                                1955                                    66 and 2 months
 8                                                1956                                    66 and 4 months
 9                                                1957                                    66 and 6 months
 10                                               1958                                    66 and 8 months
 11                                               1959                                   66 and 10 months
 12                                     1960 and later                                                 67
 13  Notes: 1. Persons born on January 1 of any yea...  Notes: 1. Persons born on January 1 of any yea...]

# 3. PANDAS OPERATIONS

In [25]:
# Let's define a dataframe as follows:
bank_client_df = pd.DataFrame({'Bank client ID': [111, 222, 333, 444],
                               "Bank Client Name": ['Chanel', 'Steve', 'Mitch', 'Ryan'],
                               "Net worth [$]": [3500, 29000, 10000, 2000],
                               "Years with bank": [3, 4, 9, 5]})
bank_client_df

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [26]:
# Pick certain rows that satisfy a certain criteria 
df_loyal = bank_client_df.loc[bank_client_df["Years with bank"] >= 5]
df_loyal

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [27]:
# Delete a column from a DataFrame
del bank_client_df['Bank client ID'] 
bank_client_df

  Bank Client Name  Net worth [$]  Years with bank
0           Chanel           3500                3
1            Steve          29000                4
2            Mitch          10000                9
3             Ryan           2000                5

**MINI CHALLENGE #3:**
- **Using "bank_client_df" DataFrame, leverage pandas operations to only select high networth individuals with minimum $5000** 
- **What is the combined networth for all customers with 5000+ networth?**

In [28]:
df_high_networth = bank_client_df.loc[bank_client_df['Net worth [$]'] >= 5000]
df_high_networth

  Bank Client Name  Net worth [$]  Years with bank
1            Steve          29000                4
2            Mitch          10000                9

In [29]:
df_high_networth["Net worth [$]"].sum()

39000

# 4. PANDAS WITH FUNCTIONS

In [30]:
# Let's define a dataframe as follows:
bank_client_df = pd.DataFrame({'Bank client ID': [111, 222, 333, 444],
                               "Bank Client Name": ['Chanel', 'Steve', 'Mitch', 'Ryan'],
                               "Net worth [$]": [3500, 29000, 10000, 2000],
                               "Years with bank": [3, 4, 9, 5]})
bank_client_df

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [31]:
# Define a function that increases all clients networth (stocks) by a fixed value of 10% (for simplicity sake) 
def networth_update(balance):
  return balance * 1.1

In [32]:
# You can apply a function to the DataFrame 
bank_client_df["Net worth [$]"].apply(networth_update)

0     3850.0
1    31900.0
2    11000.0
3     2200.0
Name: Net worth [$], dtype: float64

In [33]:
bank_client_df["Bank Client Name"].apply(len)

0    6
1    5
2    5
3    4
Name: Bank Client Name, dtype: int64

In [34]:
bank_client_df["Years with bank"].sum()

21

**MINI CHALLENGE #4:**
- **Define a function that doubles stock prices and adds $100**
- **Apply the function to the DataFrame**
- **Calculate the updated total networth of all clients combined**

In [35]:
def networth_update_1(balance):
  return balance * 2 + 100

In [36]:
result = bank_client_df["Net worth [$]"].apply(networth_update_1)
result

0     7100
1    58100
2    20100
3     4100
Name: Net worth [$], dtype: int64

In [37]:
result.sum()

89400

# 5. SORTING AND ORDERING

In [38]:
# Let's define a dataframe as follows:
bank_client_df = pd.DataFrame({'Bank client ID': [111, 222, 333, 444],
                               "Bank Client Name": ['Chanel', 'Steve', 'Mitch', 'Ryan'],
                               "Net worth [$]": [3500, 29000, 10000, 2000],
                               "Years with bank": [3, 4, 9, 5]})
bank_client_df

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [39]:
# You can sort the values in the dataframe according to number of years with bank
bank_client_df.sort_values(by="Years with bank")

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
3             444             Ryan           2000                5
2             333            Mitch          10000                9

In [40]:
# Note that nothing changed in memory! you have to make sure that inplace is set to True
bank_client_df

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [41]:
# Set inplace = True to ensure that change has taken place in memory 
bank_client_df.sort_values(by="Years with bank", inplace=True)

In [42]:
# Note that now the change (ordering) took place 
bank_client_df

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
3             444             Ryan           2000                5
2             333            Mitch          10000                9

**MINI CHALLENGE #5:**
- **Sort customers by networth instead of years with bank. Make sure to update values in-memory.**

In [43]:
bank_client_df.sort_values(by="Net worth [$]", inplace=True)
bank_client_df

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
3             444             Ryan           2000                5
0             111           Chanel           3500                3
2             333            Mitch          10000                9
1             222            Steve          29000                4

# 6. CONCATENATING AND MERGING WITH PANDAS

Check this out: https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [44]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                      index=[0, 1, 2, 3])

In [45]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [46]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                    index=[4, 5, 6, 7])

In [47]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [48]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                     index=[8, 9, 10, 11])

In [49]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [50]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [51]:
# Creating a dataframe from a dictionary
# Let's define a dataframe with a list of bank clients with IDs = 1, 2, 3, 4, 5 

raw_data = {"Bank Client ID": ['1', '2', '3', '4', '5'],
            "First Name": ['Nancy', 'Alex', 'Shep', 'Max', 'Allen'],
            "Last Name": ['Rob', 'Ali', 'George', 'Mitch', 'Steve']}
raw_data

{'Bank Client ID': ['1', '2', '3', '4', '5'],
 'First Name': ['Nancy', 'Alex', 'Shep', 'Max', 'Allen'],
 'Last Name': ['Rob', 'Ali', 'George', 'Mitch', 'Steve']}

In [52]:
bank_df_1 = pd.DataFrame(raw_data, columns = ['Bank Client ID', 'First Name', 'Last Name'])
bank_df_1

  Bank Client ID First Name Last Name
0              1      Nancy       Rob
1              2       Alex       Ali
2              3       Shep    George
3              4        Max     Mitch
4              5      Allen     Steve

In [53]:
# Let's define another dataframe for a separate list of clients (IDs = 6, 7, 8, 9, 10)
raw_data = {"Bank Client ID": ['6', '7', '8', '9', '10'],
            "First Name": ['Bill', 'Dina', 'Sarah', 'Heather', 'Holly'],
            "Last Name": ['Christian', 'Mo', 'Steve', 'Bob', 'Michelle']}
bank_df_2 = pd.DataFrame(raw_data, columns = ['Bank Client ID', 'First Name', 'Last Name'])
bank_df_2

  Bank Client ID First Name  Last Name
0              6       Bill  Christian
1              7       Dina         Mo
2              8      Sarah      Steve
3              9    Heather        Bob
4             10      Holly   Michelle

In [54]:
# Let's assume we obtained additional information (Annual Salary) about our bank customers 
# Note that data obtained is for all clients with IDs 1 to 10
raw_data = {'Bank Client ID': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'],
             "Annual Salary [$/year]": [25000, 35000, 45000, 48000, 49000, 32000, 33000, 34000, 23000, 22000]}
bank_df_salary = pd.DataFrame(raw_data, columns = ['Bank Client ID', 'Annual Salary [$/year]'])
bank_df_salary

  Bank Client ID  Annual Salary [$/year]
0              1                   25000
1              2                   35000
2              3                   45000
3              4                   48000
4              5                   49000
5              6                   32000
6              7                   33000
7              8                   34000
8              9                   23000
9             10                   22000

In [55]:
# Let's concatenate both dataframes #1 and #2
# Note that we now have client IDs from 1 to 10
bank_df_all = pd.concat([bank_df_1, bank_df_2])
bank_df_all

  Bank Client ID First Name  Last Name
0              1      Nancy        Rob
1              2       Alex        Ali
2              3       Shep     George
3              4        Max      Mitch
4              5      Allen      Steve
0              6       Bill  Christian
1              7       Dina         Mo
2              8      Sarah      Steve
3              9    Heather        Bob
4             10      Holly   Michelle

In [56]:
# Let's merge all data on 'Bank Client ID'
pd.merge(bank_df_all, bank_df_salary, how='inner')

  Bank Client ID First Name  Last Name  Annual Salary [$/year]
0              1      Nancy        Rob                   25000
1              2       Alex        Ali                   35000
2              3       Shep     George                   45000
3              4        Max      Mitch                   48000
4              5      Allen      Steve                   49000
5              6       Bill  Christian                   32000
6              7       Dina         Mo                   33000
7              8      Sarah      Steve                   34000
8              9    Heather        Bob                   23000
9             10      Holly   Michelle                   22000

**MINI CHALLENGE #6:**
- **Let's assume that you became a new client to the bank**
- **Define a new DataFrame that contains your information such as client ID (choose 11), first name, last name, and annual salary.**
- **Add this new dataframe to the original dataframe "bank_df_all".**

In [57]:
new_client = {'Bank Client ID': ['11'], 'First Name': ["Ryan"], 'Last Name': ["Aly"], "Annual Salary [$/year]": [8000]}

In [58]:
new_client_df = pd.DataFrame(new_client, columns = ["Bank Client ID", "First Name", "Last Name", "Annual Salary [$/year]"])
new_client_df

  Bank Client ID First Name Last Name  Annual Salary [$/year]
0             11       Ryan       Aly                    8000

In [59]:
new_df = pd.concat([bank_df_all, new_client_df], axis=0)
new_df.reset_index(drop=True)

   Bank Client ID First Name  Last Name  Annual Salary [$/year]
0               1      Nancy        Rob                     NaN
1               2       Alex        Ali                     NaN
2               3       Shep     George                     NaN
3               4        Max      Mitch                     NaN
4               5      Allen      Steve                     NaN
5               6       Bill  Christian                     NaN
6               7       Dina         Mo                     NaN
7               8      Sarah      Steve                     NaN
8               9    Heather        Bob                     NaN
9              10      Holly   Michelle                     NaN
10             11       Ryan        Aly                  8000.0

# EXCELLENT JOB!

# MINI CHALLENGE SOLUTIONS

**MINI CHALLENGE #1 SOLUTION:**
- **A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)**
- **Calculate the total value of the porfolio including all stocks**

In [60]:
portfolio_df = pd.DataFrame({'stock ticker symbols':['AAPL', 'AMZN', 'T'],
                             'price per share [$]':[3500, 200, 40], 
                             'Number of stocks':[3, 4, 9]})
portfolio_df

  stock ticker symbols  price per share [$]  Number of stocks
0                 AAPL                 3500                 3
1                 AMZN                  200                 4
2                    T                   40                 9

In [61]:
stocks_dollar_value = portfolio_df['price per share [$]'] * portfolio_df['Number of stocks']
print(stocks_dollar_value)
print('Total portfolio value = {}'.format(stocks_dollar_value.sum()))

0    10500
1      800
2      360
dtype: int64
Total portfolio value = 11660

**MINI CHALLENGE #2 SOLUTION:**
- **Write a code that uses Pandas to read tabular US retirement data**
- **You can use data from here: https://www.ssa.gov/oact/progdata/nra.html**

In [62]:
# Read tabular data using read_html
retirement_age_df = pd.read_html('https://www.ssa.gov/oact/progdata/nra.html')
retirement_age_df

[                                        Year of birth                                                Age
 0                                      1937 and prior                                                 65
 1                                                1938                                    65 and 2 months
 2                                                1939                                    65 and 4 months
 3                                                1940                                    65 and 6 months
 4                                                1941                                    65 and 8 months
 5                                                1942                                   65 and 10 months
 6                                             1943-54                                                 66
 7                                                1955                                    66 and 2 months
 8                                                1956                                    66 and 4 months
 9                                                1957                                    66 and 6 months
 10                                               1958                                    66 and 8 months
 11                                               1959                                   66 and 10 months
 12                                     1960 and later                                                 67
 13  Notes: 1. Persons born on January 1 of any yea...  Notes: 1. Persons born on January 1 of any yea...]

**MINI CHALLENGE #3 SOLUTION:**
- **Using "bank_client_df" DataFrame, leverage pandas operations to only select high networth individuals with minimum $5000** 
- **What is the combined networth for all customers with 5000+ networth?**

In [63]:
df_high_networth = bank_client_df[ (bank_client_df['Net worth [$]'] >= 5000) ]
df_high_networth

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
2             333            Mitch          10000                9
1             222            Steve          29000                4

In [64]:
df_high_networth['Net worth [$]'].sum()

39000

**MINI CHALLENGE #4 SOLUTION:**
- **Define a function that doubles stock prices and adds $100**
- **Apply the function to the DataFrame**
- **Calculate the updated total networth of all clients combined**

In [65]:
def networth_update(balance):
    return balance * 2 + 100 # assume that stock prices increased by 10%

In [66]:
# You can apply a function to the DataFrame 
results = bank_client_df['Net worth [$]'].apply(networth_update)
results

3     4100
0     7100
2    20100
1    58100
Name: Net worth [$], dtype: int64

In [67]:
results.sum()

89400

**MINI CHALLENGE #5 SOLUTION:**
- **Sort customers by networth instead of years with bank. Make sure to update values in-memory.**

In [68]:
# You can sort the values in the dataframe according to number of years with bank
bank_client_df.sort_values(by = 'Net worth [$]', inplace = True) 
bank_client_df

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
3             444             Ryan           2000                5
0             111           Chanel           3500                3
2             333            Mitch          10000                9
1             222            Steve          29000                4

**MINI CHALLENGE #6 SOLUTION:**
- **Let's assume that you became a new client to the bank**
- **Define a new DataFrame that contains your information such as client ID (choose 11), first name, last name, and annual salary.**
- **Add this new dataframe to the original dataframe "bank_df_all".**

In [69]:
new_client = {
        'Bank Client ID': ['11'],
        'First Name': ['Ry'], 
        'Last Name': ['Aly'],
        'Annual Salary [$/year]' : [1000]}
new_client_df = pd.DataFrame(new_client, columns = ['Bank Client ID', 'First Name', 'Last Name', 'Annual Salary [$/year]'])
new_client_df

  Bank Client ID First Name Last Name  Annual Salary [$/year]
0             11         Ry       Aly                    1000

In [70]:
new_df = pd.concat([bank_df_all, new_client_df], axis = 0)
new_df

  Bank Client ID First Name  Last Name  Annual Salary [$/year]
0              1      Nancy        Rob                     NaN
1              2       Alex        Ali                     NaN
2              3       Shep     George                     NaN
3              4        Max      Mitch                     NaN
4              5      Allen      Steve                     NaN
0              6       Bill  Christian                     NaN
1              7       Dina         Mo                     NaN
2              8      Sarah      Steve                     NaN
3              9    Heather        Bob                     NaN
4             10      Holly   Michelle                     NaN
0             11         Ry        Aly                  1000.0